.zsh_aliases
#!/usr/zsh
# [[file:docs/zsh_aliases.org::*Brew][Brew:1]]
if type brew &>/dev/null; then
	function pi {
		brew install "${@:1}"
		brew bundle dump --force --global
	}
	function pic {
		brew install --cask "${@:1}"
		brew bundle dump --force --global
	}
	function pr {
		brew uninstall "${@:1}"
		brew bundle dump --force --global
	}

	alias psearch="brew search"
	alias pinfo="brew info"
	alias pu="brew update && brew upgrade"
	alias orphans="brew autoremove"
	alias bdump="brew bundle dump --force --global"
fi
# Brew:1 ends here

# [[file:docs/zsh_aliases.org::*Editor functions][Editor functions:1]]
alias edit="$EDITOR"
alias zshrc="$EDITOR ~/docs/zshrc.org "
alias zshenv="$EDITOR ~/docs/zshenv.org"
alias zshaliases="$EDITOR ~/docs/zsh_aliases.org"

alias em='emacsclient -c -n'
alias emw='emacsclient -c'

alias reload='source ~/.zshenv && source ~/.zshrc'
# Editor functions:1 ends here

# [[file:docs/zsh_aliases.org::*Other][Other:1]]
if type python3 &>/dev/null; then
	alias python="python3"
	alias pip="pip3"
fi

alias psxa="ps xa | rg"
# Other:1 ends here
